AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыКПоступлению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКПоступлению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КПоступлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма без доп. расходов в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика/серия номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость регл. учета с учетом налогов но без доп. расходов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлассификаторПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого товар был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил товар или которому была оказана услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПриходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПриходованиеТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ЗапасыСервер/Ext/Module.bsl
#Область ПроцедурыЗаписиДвиженийВРегистр

Процедура ОтразитьОстаткиТоваровКомпании(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиТоваровКомпании;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиТоваровКомпании.Записывать = Истина;
	Движения.ОстаткиТоваровКомпании.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТоварыКПоступлению;
	
	Если Отказ
		//ИЛИ Таблица.Количество() = 0 
		Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ТоварыКПоступлению.Записывать = Истина;
	Движения.ТоварыКПоступлению.Загрузить(Таблица);
	
КонецПроцедуры


Процедура ОтразаитьПартииТоваровКомпании(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваровКомпании;
	
	Если Отказ  ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ДвиженияПартииТоваровИзменение")Тогда
		Движения.ПартииТоваровКомпании.Записывать = ДополнительныеСвойства.ДвиженияПартииТоваровИзменение;
	Иначе
		Движения.ПартииТоваровКомпании.Записывать = Истина;
	КонецЕсли;
	
	Движения.ПартииТоваровКомпании.Загрузить(Таблица);	
	
КонецПроцедуры

Процедура ОтразаитьПродажиТоваровКомпании(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажиТоваровКомпании;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Продажи.Записывать = Истина;
	Движения.Продажи.Загрузить(Таблица);	
	
КонецПроцедуры

Процедура ОтразаитьПриходованиеТоваров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПриходованиеТоваров;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ПриходованиеТоваров.Записывать = Истина;
	Движения.ПриходованиеТоваров.Загрузить(Таблица);	
	
КонецПроцедуры

Процедура ОтразаитьПроизводство(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПроизводство;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Производство.Записывать = Истина;
	Движения.Производство.Загрузить(Таблица);	
	
КонецПроцедуры

Процедура ОтразитьКвотыНаОтгрузку(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_КвотыНаОтгрузку;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ТК_КвотыНаОтгрузку.Записывать = Истина;
	Движения.ТК_КвотыНаОтгрузку.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьПравилаСписанияДопМатериалов(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_ПравилаСписанияДопМатериалов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ТК_ПравилаСписанияДопМатериалов.Записывать = Истина;
	Движения.ТК_ПравилаСписанияДопМатериалов.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьОстаткиОрганизации(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваровОрганизации;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиОрганизации.Записывать = Истина;
	Движения.ОстаткиОрганизации.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьПотребностьОрганизации(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПотребностиТоваровОрганизации;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ПотребностиОрганизаций.Записывать = Истина;
	Движения.ПотребностиОрганизаций.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьПланирование(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_Планирование;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ТК_Планирование.Записывать = Истина;
	Движения.ТК_Планирование.Загрузить(Таблица);
	
КонецПроцедуры


Процедура ОтразитьКонсолидированныеПродажи(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКонсолидированныеПродажи;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.КонсолидированныеПродажи.Записывать = Истина;
	Движения.КонсолидированныеПродажи.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьПогрешностиДокументов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПогрешностиДокументов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ПогрешностиДокументов.Записывать = Истина;
	Движения.ПогрешностиДокументов.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьРозничныеПродажиПодакцизныхТоваров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРозничныеПродажиПодакцизныхТоваров;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.РозничныеПродажиПодакцизныхТоваров.Записывать = Истина;
	Движения.РозничныеПродажиПодакцизныхТоваров.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьВозвратнаяТара(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВозвратнаяТара;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ВозвратнаяТара.Записывать = Истина;
	Движения.ВозвратнаяТара.Загрузить(Таблица);	
	
КонецПроцедуры


Процедура ОтразаитьТоварыТМП(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиТоваровТМП;
	
	Если Отказ  ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиТоваровТМП.Записывать = Истина;
	Движения.ОстаткиТоваровТМП.Загрузить(Таблица);	
	
КонецПроцедуры


#КонецОбласти



Процедура УстановитьБлокировкуОстатоковТоваровКомпании(МенеджерВременныхТаблиц)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.СкладКомпании КАК СкладКомпании,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаТоваров КАК ТаблицаТоваров
	|		ПО (ИСТИНА)";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СкладКомпании", "СкладКомпании");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	
	Блокировка.Заблокировать();
	
	
КонецПроцедуры
// Функция формирует таблицу ошибок остатков товаров.
//
Функция ТаблицаОшибокОстатковТоваров() Экспорт
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("Номенклатура");
	ТаблицаОшибок.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаОшибок.Колонки.Добавить("Склад");
	ТаблицаОшибок.Колонки.Добавить("Количество");
	ТаблицаОшибок.Колонки.Добавить("ЕдиницаИзмерения");
	
	Возврат ТаблицаОшибок;
	
КонецФункции 

// Процедура формирует таблицу остатков товаров компании.
//
// Параметры:
//	ДокументСсылка - Текущий документ
//	Склад - СправочникСсылка.СкладыКомпании - Склад документа
//	Дата - Дата документа
//	ДополнительныеСвойства - Структура - Дополнительные свойства документа
//	МенеджерВременныхТаблиц - Менеджер временных таблиц
Процедура ТаблицаОстатковТоваровКомпании(ДокументСсылка, Склад, Дата, ДополнительныеСвойства, МенеджерВременныхТаблиц) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КонтрольРезерва = Ложь;               
	Если ДополнительныеСвойства.Свойство("ВыполнитьКонтрольРезерва") Тогда
		КонтрольРезерва = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТекстЗапроса = "";
	ДатаДокументаСдвинутаНазад = ДополнительныеСвойства.Свойство("СтараяДатаДокумента") И   Дата < ДополнительныеСвойства.СтараяДатаДокумента ;
	Если НЕ ДатаДокументаСдвинутаНазад Тогда
		
		ТекстЗапроса = ТекстЗапроса + 	"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ДвиженияДокумента
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании КАК Товары
		|ГДЕ
		|	Товары.Регистратор = &Ссылка
		|	И Товары.Активность
		|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И (Товары.Номенклатура, Товары.ХарактеристикаНоменклатуры) В
		|			(ВЫБРАТЬ
		|				ВтТаблицаТоваров.Номенклатура КАК Номенклатура,
		|				ВтТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|			ИЗ
		|				ВтТаблицаТоваров КАК ВтТаблицаТоваров)
		|	И Товары.СкладКомпании = &СкладКомпании
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";	
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +"
	|  ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиТоваров
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&Момент,
	|			СкладКомпании = &СкладКомпании
	|				И (Номенклатура, ХарактеристикаНоменклатуры) В
	|					(ВЫБРАТЬ
	|						ВтТаблицаТоваров.Номенклатура КАК Номенклатура,
	|						ВтТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|					ИЗ
	|						ВтТаблицаТоваров КАК ВтТаблицаТоваров)) КАК Остатки
	|;
	|";
	
	Если КонтрольРезерва Тогда
		ТекстЗапроса = ТекстЗапроса+"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезервыТоваровОстатки.Номенклатура КАК Номенклатура,
		|	РезервыТоваровОстатки.Характеристика КАК Характеристика,
		|	РезервыТоваровОстатки.РезервОстаток КАК РезервОстаток
		|ПОМЕСТИТЬ втРезерв
		|ИЗ
		|	РегистрНакопления.РезервыТоваров.Остатки(
		|			&Момент,
		|			Склад = &СкладКомпании
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВтТаблицаТоваров.Номенклатура КАК Номенклатура,
		|						ВтТаблицаТоваров.ХарактеристикаНоменклатуры КАК Характеристика
		|					ИЗ
		|						ВтТаблицаТоваров КАК ВтТаблицаТоваров)) КАК РезервыТоваровОстатки
		|	ГДЕ
		|	РезервыТоваровОстатки.РезервОстаток > 0
		|;";
		
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса+"
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВтТоварыДокумента.Номенклатура КАК Номенклатура,
	|		ВтТоварыДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(-ВтТоварыДокумента.Количество) КАК Количество
	|	ИЗ
	|		ВтТаблицаТоваров КАК ВтТоварыДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВтТоварыДокумента.ХарактеристикаНоменклатуры,
	|		ВтТоварыДокумента.Номенклатура
	|";	
	
	Если НЕ ДатаДокументаСдвинутаНазад Тогда
		ТекстЗапроса = ТекстЗапроса +"
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Номенклатура,
		|		ДвиженияДокумента.ХарактеристикаНоменклатуры,
		|		ДвиженияДокумента.Количество
		|	ИЗ
		|		ДвиженияДокумента КАК ДвиженияДокумента";
	КонецЕсли;
	
	Если КонтрольРезерва Тогда
		ТекстЗапроса = ТекстЗапроса +"
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		втРезерв.Номенклатура,
		|		втРезерв.Характеристика,
		|		-втРезерв.РезервОстаток
		|	ИЗ
		|		втРезерв КАК втРезерв";
		
	КонецЕсли;
	
	
	ТекстЗапроса = ТекстЗапроса +"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиТоваров.Номенклатура,
	|		ОстаткиТоваров.ХарактеристикаНоменклатуры,
	|		ОстаткиТоваров.КоличествоОстаток
	|	ИЗ
	|		ОстаткиТоваров КАК ОстаткиТоваров) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Номенклатура
	|;";
	Если НЕ ДатаДокументаСдвинутаНазад Тогда
		ТекстЗапроса = ТекстЗапроса + "
		
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДвиженияДокумента
		|; ";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса +"
	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОстаткиТоваров";
	Запрос.Текст =  ТекстЗапроса;
	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("СкладКомпании", Склад);
	Запрос.УстановитьПараметр("Момент",?(ДополнительныеСвойства.ЭтоНовый,Неопределено, Новый Граница(Дата,ВидГраницы.Включая)));
	Запрос.Выполнить();
	
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОшибок(МенеджерВременныхТаблиц,ДополнительныеСвойства,ТаблицаОшибок,Отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатков.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаОстатков.Количество КАК Количество
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|ГДЕ
	|	ТаблицаОстатков.Количество < 0
	|";
	
	РезультатЗпроса = Запрос.Выполнить();
	Если Не РезультатЗпроса.Пустой()  Тогда
		Если  Не ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "РазрешитьОтрицательныеОстатки", Ложь)  Тогда
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗпроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = ТаблицаОшибок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
	
КонецПроцедуры



#Область ПроверкаДублированияПредопределенныхЭлементов

Процедура ПроверитьРезервированиеЗаказовПокупателя(Проверка, ПараметрыПроверки)		Экспорт
	
	ПоДату = НачалоДня(ТекущаяДата()) - 2*24*60*60;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезервыТоваровОстатки.Заказ КАК Заказ,
	|	РезервыТоваровОстатки.РезервОстаток КАК РезервОстаток,
	|	РезервыТоваровОстатки.Заказ.Автор КАК Автор
	|ИЗ
	|	РегистрНакопления.РезервыТоваров.Остатки(, ) КАК РезервыТоваровОстатки
	|ГДЕ
	|	РезервыТоваровОстатки.Заказ.Дата < &ПоДату
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ПоДату", ПоДату);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Проблема = КонтрольВеденияУчета.ОписаниеПроблемы(Результат.Заказ, ПараметрыПроверки);
		
		Проблема.УточнениеПроблемы = НСтр("ru = 'Есть остаток по резерву '")+Результат.Заказ;
		//Проблема.Ответственный     =  Результат.Автор;
		Проблема.Вставить("ТорговаяПлощадка", Результат.Заказ.ТорговаяПлощадка);
		
		КонтрольВеденияУчета.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
